%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 说明：平均值法计算定积分
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function average_method_for_definite_integral
% 积分上下限
a=0;
b=1;
% 试验点数
N=1e5;
% 运行10次，查看结果
Experiment=zeros(1,10);
for k=1:10
    Experiment(k)=fun(a,b,N);
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function result=fun(a,b,mm)
% a是积分的下限影,b积分的上限
% 积分函数,mm是随机试验次数
sum=0;
xrandnum = unifrnd(a,b,1,mm);
for ii=1:mm
    sum=sum+exp (xrandnum(1,ii));
end
result=sum/mm
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%