%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能说明：从1-10个编号的球中有放回抽取3个，求抽到都为偶数的概率
% Fig.4-4
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function classical_probabilistic_simulation
N=50; %重复做N次
m=10000; %每次试验m次
P=zeros(1,N); %每次的概率
for k=1:N %开始模拟N次
    P(k)=fun(m);
end
Pave=mean(P); %计算均值
% 画图
figure
hold on;box on;
plot(P);
line([0,N],[Pave,Pave],'LineWidth',5,'Color','r');
xlabel('k');
ylabel('概率估计值');
title('有放回抽取球试验');
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 函数功能:一次试验得到全为偶数的概率
% 输入参数:M为有放回抽取3个球，重复做了多少次
function p=fun(M)
frq=0; %全为偶数的频数初始化
MAX=10; %球的编号的最大值
for k=1:M %开始模拟抽取3个球
    % 调用随机函数，产生1-10之间的数，共有放回抽取3个
    ball1=unidrnd(MAX);
    ball2=unidrnd(MAX);
    ball3=unidrnd(MAX);
    % 现在来统计是否均为偶数
    if( (mod(ball1,2)==0) &&  (mod(ball2,2)==0) && (mod(ball3,2)==0) )
        % 三个数的乘积能被2整除，则三个数必然全为偶数
        frq=frq+1;
    end
end
% 频率=概率
p=frq/M;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%