%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  说明：模拟两人会面的概率
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function geometric_probabilistic_simulation
m=10000; %随机模拟两人会面的次数
success=0; %两人成果会面的次数初始化为0
% 开始模拟每一次的会面
for i=1:m
    % 用计算机产生(0，60)之间均匀分布的随机数，为第一个人到达时间
    time1=unifrnd(0,60);
    % 用计算机产生(0，60)之间均匀分布的随机数，为第二个人到达时间
    time2=unifrnd(0,60);
    % 判断两个人时间差是否能会面上
    if abs(time1-time2)<=20
        success=success+1; %成功会面
    end
end
% 计算会面成功的概率
P=success/m
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%