%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  说明：重要抽样法计算定积分
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function important_sampling_method_for_definite_integral
% 积分的上下限
a=0;
b=1;
% 试验点数
N=1e5;
fun(a,b,N);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function result=fun(a,b,mm)
% a是积分的下限影,b积分的上限
% 积分函数,mm是随机试验次数
sum=0;
xrandnum = -1+sqrt(1+3.*unifrnd(a,b,1,mm));
for ii=1:mm
    sum=sum+exp (xrandnum(1,ii))/(1+ xrandnum(1,ii));
end
result=1.5*sum/mm
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%