%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能说明：模拟走出矿井实验
% Fig.4-5
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function mine_escape_simulation
N=1000; %试验次数
% SUCCESS=0; %选对的标志
Time=zeros(1,N); %各次试验分别花费的时间
for k=1:N
    % 开始模拟选择通道
    t=0;
    while(1)
        % 模拟矿工随机选择矿道
        number=getChannel();
        % 根据选择的矿道不同，计算时间开销
        if(number==1)           %选择第一条通道
            t=t+3;
            break;              %选对矿道，跳出死循环
        elseif(number==2)       %选择第二条通道
            t=t+5;
        else                    %选择第三条通道
            t=t+7;
        end
    end
    % 记下本次试验总时间
    Time(k)=t;
end
% 计算平均时间
TimerAve=mean(Time);
% 最长需要多少时间走出矿井
Tmax=max(Time);
% 最短需要多长时间走出矿井
Tmin=min(Time);
fprintf('走出矿井最长时间为%d,最短时间为%d,平均时间为%0.2f',Tmax,Tmin,TimerAve);
% 画图显示，每次试验的时间
figure
hold on;box on;
plot(Time);
% 调用line(x，y)函数来画一条直线，该直线代表平均时间
line([0,N],[TimerAve,TimerAve],'LineWidth',5,'Color','r');
xlabel('k');
ylabel('时间开销')
legend('时间开销','平均时间开销')
title('矿井逃脱模拟')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function d=getChannel()
% 因为rand()产生都是0-1之间的小数，乘以3则在0-3之间
d=3*rand();
% 经过fix()函数之后，它的值则变为0-2之间的整数
d=fix(d);
% 加1，成为1-3之间的整数
d=d+1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%