%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 说明：计算定积分
% Fig.4-9
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function random_drop_method_for_definite_integral
% 积分的上下限
a=0;
b=4;
% M值为f(x)的限值
M=4;
% 本次试验投点总数
N=1e5;
% 现在开始模拟投点的过程
% 初始化在被积函数下方的点的数目
freq=0;
for i=1:N
    % 产生随机数ui和vi,本质上是投点(x，y)的位置
    u=unifrnd(a,b);
    v=unifrnd(0,M);
    % 判断本次投点的位置是否在被积函数的下方
    if (cos(u)+2.0) >= v
        freq=freq+1;
    end
end
% 最后来计算概率
p=freq/N;
% 进而计算最终结果
result=p*(b-a)*M
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%