%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能说明：硬币投掷实验，计算机模拟
% Fig.4-3
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function uneven_coin_tossing_simulation
% 正面朝上的概率
p=0.4;
% 试验次数
N=1000;
% sum用于统计正面朝上的次数
sum=0;
% 现在开始模拟投掷过程
for k=1:N
    % 第k次试验，两枚硬币分别用binornd()函数产生一个随机数
    cion1=binornd(1,p);
    cion2=binornd(1,p);
    % 只有乘积为1(两个都为正面)，才能为sum带来数据的递增
    sum=sum+cion1*cion2;
    % 计算第k次实验时，它的频率
    P(k)=sum/k;
end
% 画图显示各次实验的结果
figure
hold on;box on;
plot(1:N,P);
xlabel('k');
ylabel('出现正面的频率');
title('投掷不均匀硬币试验结果')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%