%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：单站多目标跟踪的建模程序
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function MTT_Model_Of_SingleStation
% 初始化参数
% 观测站位置，随机的
T=50;                 % 仿真时间长度
TargetNum=3;           % 目标个数
dt=1;                  % 采样时间间隔
Station.x=100*rand;          % 观测站水平位置
Station.y=100*rand;          % 观测站纵向位置
F=[1,dt,0,0;0,1,0,0;0,0,1,dt;0,0,0,1];  % 采用CV模型的状态转移矩阵
G=[0.5*dt^2,0;dt,0;0,0.5*dt^2;0,dt];    % 过程噪声驱动矩阵
H=[1,0,0,0;0,0,1,0];                    % 观测矩阵
Q=diag([0.02,0.001]); % 过程噪声方差
R=diag([5,5]);         % 观测噪声方差
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
X=zeros(4,T,TargetNum);% 目标状态初始化
Z=zeros(2,T,TargetNum);
for i=1:TargetNum
    % 目标初始状态，y的位置和y方向的速度是随机的，读者可以修改成其他的值
    X(:,1,i)=[3,100/T,80*(i-1),100/T+0.1*randn];
    % 观测初始化
    Z(:,1,i)=H*X(:,1,i)+sqrt(R)*randn(2,1);
end
% 模拟目标运动，观测站对目标观测
for t=2:T
    for j=1:TargetNum
        % 第j个目标的状态方程
        X(:,t,j)=F*X(:,t-1,j)+G*sqrt(Q)*randn(2,1);
        % 单个观测站对第j个目标观测，观测方程
        Z(:,t,j)=H*X(:,t,j)+sqrt(R)*randn(2,1);
    end
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 画图
figure
hold on,box on;
for j=1:TargetNum
    plot(X(1,:,j),X(3,:,j),'-r')  % 多个目标的真实轨迹
    plot(Z(1,:,j),Z(2,:,j),'-b.')  % 单个观测站对多个目标观测轨迹
end
legend('真实轨迹','观测轨迹');
xlabel('X/m');ylabel('Y/m');
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
