%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  版权声明
%  黄小平，王岩 著，《卡尔曼滤波原理及应用-MATLAB仿真》第2版，电子工业出版社
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%在命令行中 使用 Ctrl+C 结束
function ex2_27
% 数据先一次性生成
t=0:0.1:100*pi;
m=sin(t);
figure('Name','动态显示数据波形')
plot(t,m);
% 数据展示的起点位置
x=-2*pi;
axis([x,x+4*pi,-2,2]);  % 展示坐标轴的范围，本质是让一小部分数据显示在窗体中
grid on
while 1
    if x>max(t)
        break;
    end
    x=x+0.1;  % 每次移动的速度为0.1
    axis([x,x+4*pi,-2,2]); %移动坐标系
    pause(0.1); % 停止一段时间
end