%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  版权声明
%  黄小平，王岩 著，《卡尔曼滤波原理及应用-MATLAB仿真》第2版，电子工业出版社
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function ex2_29
figure('Name','Totating Stick')
% 画一个绕圆点旋转的杆子
axis([0 10 0 10]); % 框定坐标的大小
% 需要旋转的杆子
stick=line([5,8],[5,5],'Color','g','LineWidth',3);
for t=0:0.1:8*pi
    % 下面绘制“十”字坐标
    line([0,10],[5,5],'Color','r','LineWidth',5)
    line([5,5],[0,10],'Color','r','LineWidth',5)
    % 设置动态的端点
    x=[5,5+5*cos(t)];
    y=[5,5+5*sin(t)];
    set(stick,'XData',x,'YData',y);  % 根据端点改变杆的位置
    drawnow;           % 刷新画面
    pause(0.1);
end
