%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  版权声明
%  黄小平，王岩 著，《卡尔曼滤波原理及应用-MATLAB仿真》第2版，电子工业出版社
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%在命令行中 使用 Ctrl+C 结束
function ex2_28
hold off
t=0;m=0;t1=[0 0.1];   % 要构成序列
m1=[sin(t1);cos(t1)];
p = plot(t,m,'*',t1,m1(1,:),'-r',t1,m1(2,:),'-b','MarkerSize',5);
x=-1.5*pi;
axis([x x+2*pi -1.5 1.5]); % 尝试一下把此行代码注释，查看效果，下同
grid on;
for i=1:100
    hold on;            % 这句话很重要，它是保持上一帧图像的关键
    t=0.1*i;            % 绘制下一个点
    m=t-floor(t);
    plot(t,m,'*');
    t1=t1+0.1;          % 绘制下一段线(组)
    m1=[sin(t1);cos(t1)];
    plot(t1,m1(1,:),'-r');
    plot(t1,m1(2,:),'-b','MarkerSize',5);
    x=x+0.1;
    axis([x x+2*pi -1.5 1.5]);   % 尝试一下把此行代码注释，查看效果
    pause(0.1);              % 停顿时间
end