%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  版权声明
%  黄小平，王岩 著，《卡尔曼滤波原理及应用-MATLAB仿真》第2版，电子工业出版社
%  函数功能：扩展卡尔曼滤波用于电源寿命预测
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function main_ekf_battery
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 加载电池观测数据
load Battery_Capacity
N=length(A12Cycle)   % cycle的总数，即电池测量数据的样本数目
% 我们选用A12Cycle这组数据中的前N个，用于对参数a,b，c,d的参数辨识
% 然后选用N之后的100个数字用于预测测试，读者也可以修改其他数字
if N>265
    N=265;  % 选取前面N个样本，辨识a,b，c,d
end
Future_Cycle=100; % 预测未来趋势，选用的样本数
% 过程噪声协方差Q
cita=1e-4;
wa=0.000001;wb=0.01;wc=0.1;wd=0.0001;
Q=cita*diag([wa,wb,wc,wd]);
% 观测噪声协方差
R=0.001;
% 驱动矩阵
F=eye(4);
% 观测矩阵H需要动态求解
% a,b,c,d赋初值
a=-0.0000083499;
b=0.055237;
c=0.90097;
d=-0.00088543;
X0=[a,b,c,d]';
P0=eye(4);   % 协方差初始化
% 滤波器状态初始化
Xekf=zeros(4,N);
Xekf(:,1)=X0;
% 观测量
Z(1:N)=A12Capacity(1:N,:)';
Zekf=zeros(1,N);
Zekf(1)=Z(1);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 扩展卡尔曼滤波算法
for k=2:N
    % 一步状态预测
    Xpredict=F*Xekf(:,k-1);
    % 观测预测
    Zpredict=hfun(Xpredict,k);
    % 求线性化的观测矩阵H
    ebk=exp(Xpredict(2)*k);  % Q(k)对a(k)求偏导数
    akebk=Xpredict(1)*k*ebk; % Q(k)对b(k)求偏导数
    edk=exp(Xpredict(4)*k);  % Q(k)对c(k)求偏导数
    ckedk=Xpredict(3)*k*edk; % Q(k)对d(k)求偏导数
    H=[ebk,akebk,edk,ckedk];
    % 协方差预测
    P=F*P0*F'+Q;
    % 求Kalman增益
    Kg=P*H'*inv(H*P*H'+R);
    % 计算新息，即用观测值减去预测值
    e=Z(k)-Zpredict;
    % 状态更新
    Xekf(:,k)=Xpredict+Kg*e;
    % 根据滤波后的状态，计算观测
    Zekf(:,k)=hfun(Xekf(:,k),k);
    % 方差更新
    P0=(eye(4)-Kg*H)*P;
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 预测未来电容的趋势
% 这里只选择 Xekf(:,start) 点的估计值，按道理是要对前期滤波得到的值做个整体处理的
% 由此导致预测不准确，后续的工作请好好处理Xekf(:,1：start)，这个矩阵的数据，平滑
% 处理 a, b,c,d然后代入方程预测未来，方能的到更好地效果
start=N-Future_Cycle;
for k=start:N
    ZQ_predict(1,k-start+1)=hfun(Xekf(:,start),k);
    XQ_predict(1,k-start+1)=k;
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 画图
figure
hold on;box on;
plot(Z,'-b.')  % 实验数据，实际测量数据
plot(Zekf,'-r.') % 滤波器滤波后的数据
plot(XQ_predict,ZQ_predict,'-g.') % 预测的电容
bar(start,1,'y')
legend('测量数据','ekf滤波','滤波预测')
xlabel('cycle');ylabel('capacity');
title('电池估计运行结果')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 函数名称：电容的观测函数
function Q=hfun(X,k)
Q=X(1)*exp(X(2)*k)+X(3)*exp(X(4)*k);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%