%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能：计算机模拟目标运动模型
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃 
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function TargetMotionModel   % 计算机模拟目标运动模型
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
dt=1; % 采样时间，单位：秒
Time=30; % 模拟总时长，也叫步数
X=zeros(4,Time); % 目标在Time时间内各个时刻的状态初始化
x0=0;y0=0;vx=0.8;vy=0.6; % 目标初始状态，包括位置和速度
X(:,1)=[x0,vx,y0,vy]';  % 第一个时刻的状态，也叫初始状态
% 系统信息，系统不同，状态转移矩阵和过程噪声驱动矩阵也不同
F=[1 dt 0 0;0 1 0 0;0 0 1 dt;0 0 0 1]; % 公式(3-31)中的fai
G=[dt^2/2 0;dt 0;0 dt^2/2;0 dt];      % 公式(3-31)中的gama
Q=0.00001;                           % 公式(3-31)中u(k)的方差，过程噪声
u=sqrt(Q)*randn(2,Time);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 现在开始模拟目标随着时间推移，目标开始发生位置移动
for k=2:Time
    X(:,k)=F*X(:,k-1)+G*u(:,k);
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
figure
hold on;box on;% 设置坐标轴的展示形式
plot(X(1,:),X(3,:),'-r.');% 画过目标的运动轨迹
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
