%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能说明：α、β为不同值时，伽马分布的概率密度函数
% Fig.3-9
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function gamacdf
a1=1;a2=2; %形状参数为不同值
b1=1;b2=2; %尺度参数为不同值
T=10000; %数据长度
x=zeros(1,T); %初始化
ya1=zeros(1,T);
ya2=ya1;
yb2=ya1;
for k=2:1:T
x(k)=x(k-1)+0.001;
ya1(k)=x(k)^a1*exp(-x(k)/b1)/(b1^a1*1); %a=1、β=1
ya2(k)=x(k)^a2*exp(-x(k)/b1)/(b1^a2*1); %a=2、β-1
yb2(k)=x(k)^a1*exp(-x(k)/b2)/(b2^a1*1); %a=1、β=2
end
figure %画出三条不同的曲线图
hold on;box on;
plot(x,ya1,'-b.');
plot(x,ya2,'-r.');
plot(x,yb2,'-g.');
xlabel('x');ylabel('y');
legend('a=1、β=1','a=2、β-1','a=1、β=2');
title('伽马分布曲线');