%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 函数功能:实现随机重采样算法
% 输入参数:weight为原始数据对应的权重大小
% 输出参数:outIndex是根据weight对inIndex筛选和复制结果
function outIndex = randomR(weight)
% 获得数据的长度
L=length(weight);
% 初始化输出索引向量，长度与输入索引向量相等
outIndex=zeros(1,L);
% 第一步:产生[0,1]上均匀分布的随机数组，并升序排列
u=unifrnd(0,1,1,L);
u=sort(u);
% 第二步:计算粒子权重累积函数cdf
cdf=cumsum(weight);
% 第三步:核心计算
i=1;
for j=1:L
    % 此处的基本原理是:u是均匀的，必然在权值大的地方
    % 有更多的随机数落入该区间，因此会被多次复制
    while (i<=L) & (u(i)<=cdf(j))
        % 复制权值大的粒子
        outIndex(i)=j;
        % 继续考察下一个随机数，看它落在哪个区间
        i=i+1;
    end
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%