%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：kalman滤波子程序
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [Xout,Pout]=KalmanFilter(Xin,Zin,Pin,F,G,H,Q,R)
Xpre=F*Xin;  % 状态预测
Zpre=H*Xpre; % 观测预测
Ppre=F*Pin*F'+G*Q*G'; % 协方差预测
K=Ppre*H'*inv(H*Ppre*H'+R);% 计算kalman增益
e=Zin-Zpre; % 新息
Xout=Xpre+K*e;  % 状态更新
Pout=(eye(4)-K*H)*Ppre; % 协方差更新
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
