%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：2个观测站对2个目标观测跟踪程序
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [ZunNew1,ZunNew2]=NNClassfier(Z1,Z2,Zun1,Zun2)
% 这里的未知类别数据是Z1和Z2，已知类别的样本集合是Zun1和Zun2
% 输出的参数ZunNew是Zun与Z合并的集合
ZunNew1=Zun1;
ZunNew2=Zun2; % 初始化，尚未假如最新的观测
[row1,col1]=size(Zun1);
[row2,col2]=size(Zun2);
% 计算数据点到2个集合的最近距离/也可以是集合中心的距离；这里选择最近样本点
%-----------------------------------------------------------------------
% 考察Z1属于哪一目标
dist1=zeros(1,col1);dist2=zeros(1,col2);
for i=1:col1
    dist1(i)=sqrt(  (Z1(1)-Zun1(1,i))^2+(Z1(2)-Zun1(2,i))^2   );
end
for i=1:col2
    dist2(i)=sqrt(  (Z1(1)-Zun2(1,i))^2+(Z1(2)-Zun2(2,i))^2   );
end
dist11=sort(dist1); % 排序，便于找到最小距离
dist12=sort(dist2); % 排序，便于找到最小距离
%-----------------------------------------------------------------------
% 考察Z2属于哪一目标
dist3=zeros(1,col1);dist4=zeros(1,col2);
for i=1:col1
    dist3(i)=sqrt(  (Z2(1)-Zun1(1,i))^2+(Z2(2)-Zun1(2,i))^2   );
end
for i=1:col2
    dist4(i)=sqrt(  (Z2(1)-Zun2(1,i))^2+(Z2(2)-Zun2(2,i))^2   );
end
dist21=sort(dist3); % 排序，便于找到最小距离
dist22=sort(dist4); % 排序，便于找到最小距离
% 综合权衡，看最终如何分类合适
% 两种情况：要么Z1->Zun1,Z2->Zun2,要么Z1->Zun2,Z2->Zun1,
if dist11(1)+dist22(1)<=dist12(1)+dist21(1)
    ZunNew1=[ZunNew1,Z1]; % 观测数据判给目标1
    ZunNew2=[ZunNew2,Z2]; % 观测数据判给目标2
else
    ZunNew1=[ZunNew1,Z2]; % 观测数据判给目标1
    ZunNew2=[ZunNew2,Z1]; % 观测数据判给目标2
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
