%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：蒙特卡洛的应用举例-圆周率π的计算
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃 
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function MonteCarlo_For_Pai_By_Buffon
length=0.6;         % 针的长度
m=20000;           % 实验次数
buffon(length,m);    % 调用子函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function pai=buffon(needlelength,mm)
% needlelength 是针的长度
% mm 是随机实验次数
frq=0; % 与平行线相交的针的数目初始化
xrandnum = unifrnd(0,0.5,1,mm);% 产生均匀分布的随机数X
phi= unifrnd(0,pi,1,mm);% 均匀分布的角度，针与平行线相交角度
for ii=1:mm
    %  if条件判断部分，请参考书中公式
    if (xrandnum(1,ii)<=(needlelength*sin(phi(1,ii))/2))
        frq=frq+1; % 相交则加1
    end    
end    
pai=2*needlelength/(frq/mm) % 最终估计的π的值
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
