%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：蒙特卡洛的应用举例-计算定积分
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function MonteCarlo_For_Integral_3
a=0;  b=1;   % 积分上下限
mm=100000;   % 实验次数
fun(a,b,mm); % 调用子函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function result=fun(a,b,mm)
%a是积分的下限   %b是积分的上限
%积分函数    %mm 是随机实验次数
sum=0;
xrandnum = -1+sqrt(1+3.*unifrnd(a,b,1,mm));
for ii=1:mm
    sum=sum+exp (xrandnum(1,ii))/(1+ xrandnum(1,ii));
end    
result=1.5*sum/mm
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%