%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：蒙特卡洛的应用举例-计算定积分
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃 
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function MonteCarlo_For_Integral_3
a=0;  b=1;   % 积分上下限
mm=100000;   % 实验次数
fun(a,b,mm); % 调用子函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function result=fun(a,b,mm)
%a是积分的下限   %b是积分的上限
%积分函数    %mm 是随机实验次数
sum=0;
urandnum = unifrnd(a,b,1,mm);
xrandnum = -1+sqrt(1+3.*unifrnd(a,b,1,mm));
for ii=1:mm
    sum=sum+exp (xrandnum(1,ii))/(1+ xrandnum(1,ii));
end    
result=1.5*sum/mm
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
