%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：蒙特卡洛的应用举例-计算定积分
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function MonteCarlo_For_Integral
a=0;  b=4;       % 积分的上下界限 a≤x≤b
M=4;             %  0≤y≤M,请参考书中的公式
N=100000;        % 实验次数
sjtdf(a,b,M,N);  % 调用子函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 子函数
function result=sjtdf(a,b,M,N)
% a是积分的下限
% b是积分的上限
% M是函数的上界
% N是随机实验次数
frq=0;
xrandnum = unifrnd(a,b,1,N); % 第一步：产生均匀分布
yrandnum = unifrnd(0,M,1,N);
for ii=1:N
    xi=cos(xrandnum(1,ii))+2; % 第二步
    yi=yrandnum(1,ii);
    if (xi>=yi)
        frq=frq+1; % 第三步
    end
end
result=frq*M*(b-a)/N  % 第四步，请对照书中的公式
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%