%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 程序说明：随机采样测试程序
% 说明：
% 请参照黄小平等编著的《目标定位跟踪原理及仿真-MATLAB仿真》，电子工业出版社
% 静心研读纸质版的书籍，有助于您理解算法原理
% 作者：放牛娃 
% 联系：hxping@mail.ustc.edu.cn
% 时间：2019年1月12日
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function RandomResamplingTest
rand('seed',1);
N=10;
W=rand(1,N);                     % 任意给定一组随机数样本
W(1,:)=W(1,:)./sum(W(1,:))       % 归一化
outIndex = randomR(W)            % 调用随机采样方法
% 经过随机采样后得到的样本V，读者要细细比较它与W样本的区别
V=W(1,outIndex) 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 画图直观显示区别                                  
figure
subplot(2,1,1);
plot(W','--ro','MarkerFace','b');
ylabel('Value of W')
xlabel('index')
subplot(2,1,2);
plot(V','--ro','MarkerFace','b');
ylabel('Value of V')
xlabel('index')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 随机重采样子函数
function outIndex = randomR(W)
% 参数说明：W是输入的需要被随机采样的数组，是1×N数组
% outIndex是输入数组W的重采样后的索引，即 V=W(outIndex)
% V就是根据索引，从W数组元素抽取元素组成的集合，是重采样的结果
N=length(W);          % 得到输入W的维数
outIndex=zeros(1,N); %  初始化
% 产生随机分布伪随机数
u=rand(1,N);  % 对照书中6.4.1节随机重采样，算法步骤（1）
u=sort(u);    % 对照书中6.4.1节随机重采样，算法步骤（2）
CS=cumsum(W); % 对W求累加和
i=1; 
for j=1:N
    while ( i<=N ) & ( u(i)<=CS(j) )
        outIndex(i)=j; % 将W数组索引放在outIndex中
        i=i+1;
    end
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
